<template>
  <v-layout fill-height column>
    <div>
      <v-layout align-center>
        <img src="/img/bulb.jpg" style="width: 60px" class="ml-8" />
        <div class="mr-5" @click="mainPage">INNOBANK</div>
        <img src="/img/telephone.jpg" style="width: 60px" />
        <div class="phoneNumber">1644-1612</div>
        <v-spacer></v-spacer>
        <v-btn text class="mr-8 greyText" @click="introduce">회사소개</v-btn>
        <v-btn text class="mr-8 greyText" @click="work">업무영역</v-btn>
        <v-btn text class="mr-8 greyText" @click="consulting">무료상담</v-btn>
        <v-btn text class="mr-8 greyText" color="gray">소식</v-btn>
        <v-btn text class="mr-8 greyText" @click="design">디자인</v-btn>
        <v-btn text class="mr-8 greyText" @click="login">로그인</v-btn>
      </v-layout>
    </div>

    <v-layout class="background2" column>
      <v-layout class="mt-10 mb-10" justify-center>
        <h1>서비스 이용약관</h1>
      </v-layout>
      <v-layout justify-center column class="mb-10">
        <v-layout column class="ml-5 mb-10">
          <h2>제 1장 총직</h2>
          <h4>제 1조 (목적)</h4>
          <div>
            이 약관은 이노뱅크(이하 "회사"라 합니다)가 제공하는
            특허추원대행서비스(이하 "서비스"라 합니다)의 이용조건 및 절차에 관한
            사항을 규정함을 목적으로 합니다.
          </div>
          <v-layout column class="mt-5">
            <h4>제 2조 (약관의 효력 및 변경)</h4>
            <div>
              ① 이 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로
              회원에게 공지함으로써 효력이 발생합니다.
            </div>
            <div>
              ② 회사는 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수
              있으며, 약관이 변경된 경우에는 최소한 7일전에 ①항과 같은 방법으로
              공시합니다.
            </div>
            <v-layout column class="mt-5">
              <h4>제 3조 (약관 외 준칙)</h4>
              <div>
                이 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법 및
                기타 관련법령의 규정에 따릅니다.
              </div>
              <v-layout column class="mt-5">
                <h4>제 4조 (용어의 정의)</h4>
                <div>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</div>
                <div>
                  ① 회원・회원사: 회사와 서비스 이용계약을 체결한 개인이나 법인
                  또는 법인에ㅔ 준하는 단체.
                </div>
                <div>
                  ② 운영자: 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가
                  선정한 사람.
                </div>
                <div>
                  ③ 아이디(ID): 회원식별과 회원의 서비스 이용을 위하여 회원가입
                  시 사용하는 문자와 숫자의 조합.
                </div>
                <div>
                  ④ 비밀번호: 회원(회원사)의 비밀 보호를 위해 회원 자신이 설정한
                  문자와 숫자의 조합.
                </div>
                <div>
                  ⑤ 서비스중지: 정상이용 중 회사가 정한 일정한 요건에 따라
                  일정기간동안 서비스의 제공을 중지하는 것.
                </div>
                <div>
                  ⑤ 해지: 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는
                  것.
                </div>
              </v-layout>
            </v-layout>
          </v-layout>
          <v-layout column class="mt-10">
            <h2>제 2장 이용계약 체결</h2>
            <h4>제 5조 (서비스의 구분)</h4>
            <div>
              ① 회사는 회원에게 제공하는 서비스는 무료서비스와 유료서비스 등으로
              구분합니다.
            </div>
            <div>
              ② 서비스의 종류와 내용 등은 회사가 공지나 서비스 이용안내에서
              별도로 정하는 바에 의합니다.
            </div>
            <v-layout column class="mt-5">
              <h4>제 6조 (이용계약의 성립)</h4>
              <div>
                ① 아래 "위의 이용약관에 동의하십니까?" 라는 물음에
                회원(회원사)이 "동의" 버튼을 누르면 이 약관에ㅔ 동의하는 것으로
                간주됩니다.
              </div>
              <div>
                ② 이용계약은 회원(회원사)이 이용신청에 대하여 회사가
                승낙함으로써 성립합니다. 회사는 신청일 24시간 이내에 이용 승낙의
                의사를 이용 신청 시 기재한 e-mail을 통하여 이용 신청자에게
                통지합니다.
              </div>
              <v-layout column class="mt-5">
                <h4>제 7조 (이용 신청 및 승낙)</h4>
                <div>
                  ① 이용신청은 서비스의 이용자등록에서 다음사항을 가입신청
                  양식에 기록하여 신청합니다.
                </div>
                <div>- 이름</div>
                <div>- e-mail</div>
                <div>- 아이디, 비밀번호</div>
                <div>- 주민등록번호</div>
                <div>- 주소</div>
                <div>- 전화번호</div>
                <div>
                  ② 이용계약은 회원의 이용자등록에 대하여 회사의 이용승낙으로
                  성립한다.
                </div>
                <div>
                  ③ 회사는 다음과 같은 사유가 발생한 경우 이용신청에 대한 승낙을
                  거부합니다.
                </div>
                <div>④ 제 9조 ③항에 해당한 경우</div>
                <v-layout column class="mt-5">
                  <h4>제 8조 (이용계약 사항의 변경)</h4>
                  <div>
                    회원은 이용 신청 시 기재한 사항이 변경되었을 경우에는
                    운영자에게 수정요청을 해야 합니다.
                  </div>
                  <v-layout column class="mt-5">
                    <h4>제 9조 (이용계약의 종료)</h4>
                    <div>
                      ① 이용계약은 회원 또는 회사가 해지에 의하여 즉시
                      처리됩니다.
                    </div>
                    <div>
                      ② 회원은 해지의사 발생 시 즉시 회사는 e-mail을 통한 해지
                      신청을 합니다.
                    </div>
                    <div>
                      ③ 다음 각 호에 해당하는 경우에 회사는 회원가입을 인정하지
                      않거나 회원 자격을 박탈할 수 있습니다.
                    </div>
                    <div>- 다른 사람의 명의를 사용하여 가입 신청한 경우</div>
                    <div>- 신청 시 필수 작성 사항을 허위로 기재한 경우</div>
                    <div>
                      - 관계법령의 위반을 목적으로 신청하거나 그러한 행위를 하는
                      경우
                    </div>
                    <div>
                      - 사회의 안녕질서 또는 미풍양속을 저해할 목적으로
                      신청하거나 그러한 행위를 하는 경우
                    </div>
                    <div>
                      - 다른 사람의 이용을 방해하거나 그 정보를 도용하는 등
                      전자거래질서를 위협하는 경우
                    </div>
                    <v-layout column class="mt-5">
                      <h4>제 10조 (개인정보의 취득 및 이용)</h4>
                      <div>
                        ① 회사는 개인정보 보호정책을 제정하여 시행하고, 개인
                        정보의 취득과 이용, 보호 등에 관한 법률을 준수합니다.
                        개인정보보호정책은 홈페이지 하단에 상시적으로
                        게시합니다.
                      </div>
                      <div>
                        ② 회사는 고객이 제공하는 개인정보를 본 서비스 이외의
                        목적을 위하여 사용할 수 없습니다.
                      </div>
                      <div>
                        ③ 회사는 고객이 제공한 개인정보를 고객의 사전 동의 없이
                        제 3자에게 제공할 수 없습니다. 단, 다음 각 호에 해당하는
                        경우에는 예외로 합니다.
                      </div>
                      <div>
                        - 전기통신기본법 등 관계법령에 의하여 국가기관의 요청에
                        의한 경우
                      </div>
                      <div>
                        - 범죄에 대한 수사상의 목적이 있거나
                        정보통신윤리위원회의 요청이 있는 경우
                      </div>
                      <div>
                        - 업무상 연락을 위하여 회원의 정보(성명, 주소,
                        전화번호)를 사용하는 경우
                      </div>
                      <div>
                        - 은행업무상 관련사항에 한하여 일부 정보를 공유하는 경우
                      </div>
                      <div>
                        - 통계작성, 홍보자료, 학술연구 또는 시장조사를 위하여
                        필요한 경우로서 특정 고객임을 식별할 수 없는 형태로
                        제공되는 경우
                      </div>
                    </v-layout>
                  </v-layout>
                </v-layout>
              </v-layout>
            </v-layout>
          </v-layout>
          <v-layout column class="mt-10">
            <h2>제 3장 서비스 이용</h2>
            <h4>제 11조 (서비스의 이용 개시)</h4>
            <div>
              ① 회사가 회원의 이용신청을 승낙할 때부터 즉시 서비스를 개시합니다.
            </div>
            <div>
              ② 회사가 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지
              못하는 경우에는 서비스에 공지하거나 회원에게 즉시 이를 통지합니다.
            </div>
            <v-layout column class="mt-5">
              <h4>제 12조 (서비스의 내용)</h4>
              <div>
                회사가 제공하는 각종 부가서비스를 이용할 수 있으며 상세한
                부가서비스의 내용은 서비스 화면에 제공됩니다.
              </div>
              <v-layout column class="mt-5">
                <h4>제 13조 (서비스의 요금 및 이용시간)</h4>
                <div>
                  ① 서비스이 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만,
                  회사의 업무상이나 기술상의 이유로 서비스가 일시중지 되거나,
                  운영상의 목적으로 회사가 정한 기간에는 서비스가 일시 중지 될
                  수 있습니다. 이러한 경우 회사는 사전 또는 사후 이를
                  공지합니다.
                </div>
                <div>
                  ② 회사는 서비스를 일정범위로 분할하여 각 범위별로 이용가능한
                  시간을 별도로 정할 수 있으며 이 경우 그 내용을 사전에
                  공지합니다.
                </div>
                <v-layout column class="mt-5">
                  <h4>제 14조 (정보의 제공 및 광고의 거재)</h4>
                  <div>
                    ① 회사는 서비스이 운용과 관련하여 서비스 화면, 홈페이지,
                    이메일 등에 광고 등을 게재할 수 있습니다.
                  </div>
                  <div>
                    ② 회사는 서비스를 운용함에 있어서 각종 정보를 서비스에
                    게재하는 방법 등으로 회원에게 제공할 수 있습니다.
                  </div>
                  <v-layout column class="mt-5">
                    <h4>제 15조 (게시물 또는 내용물의 삭제)</h4>
                    <div>
                      사는 서비스의 게시물 또는 내용물이 규정에 위반되거나
                      게시기간을초과하는 경우 사전 통지나 동의 없이 이를 삭제할
                      수 있습니다.
                    </div>
                    <v-layout column class="mt-5">
                      <h4>제 16조 (서비스 제공의 중지)</h4>
                      <div>
                        회사는 언제든지, 그리고 수시로 본 서비스(혹은 그
                        일부)를, 통지하거나 또는 통지함이 없이, 일시 또는
                        영구적으로 수정하거나 중단할 수 있습니다.
                      </div>
                      <div>
                        회원은 서비스의 수정, 중단 또는 중지에 대해 회사는 회원
                        또는 제 3자에 대하여 어떠한 책임도 지지 않음에
                        동의합니다.
                      </div>
                    </v-layout>
                  </v-layout>
                </v-layout>
              </v-layout>
            </v-layout>
          </v-layout>
          <v-layout column class="mt-10">
            <h2>제 4장 권리와 의무</h2>
            <h4>제 17조 (회사 의무)</h4>
            <div>
              ① 회사는 특별한 사유가 없는 한 서비스 제공설비를 항상 운용 가능한
              상태로 유지보수하여야하며, 안정적으로 서비스를 제공할 수 있도록
              최선의 노력을 다하여야 합니다.
            </div>
            <div>
              ② 관계 법령에 의하여 수사상의 목적으로 관계기관으로부터 요구받은
              경우, 정보통신 윤리위원회의 요청이 있는 경우, 기타 관계법령에 의한
              경우 회사는 개인정보를 제공할 수 있습니다.
            </div>
            <div>
              ③ 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 즉시
              처리하여야 하며, 즉시 처리가 곤란한 경우 그 사유와 처리일정을
              서비스 또는 전자우편을 통하여 회원에게 통지하여야 합니다.
            </div>
            <v-layout column class="mt-5">
              <h4>제 18조 (회원의 의무)</h4>
              <div>
                ① 회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에
                공지한 주의사항, 회사는 통지하는 사항을 준수하여야 하며, 기타
                회사의 업무에 방해되는 행위를 하여서는 아니됩니다.
              </div>
              <div>
                ② 회원은 회사의 사전 동의없이 서비스를 이용하여 어떠한
                영리행위도 할 수 없으며, 법에 저촉되는 자료를 배포 또는 게재할
                수 없습니다.
              </div>
              <div>
                ③ 회원은 자신의 아이디와 비밀번호를 유지 관리할 책임이 있으며
                자신의 아이디와 비밀번호를 사용하여 발생하는 모든 결과에 대해
                전적인 책임이 있습니다. 또한 자신의 아이디와 비밀번호가 자신의
                승낙없이 사용되었을 경우 즉시 회사에 신고하여야 합니다.
              </div>
              <div>
                ④ 회원은 이용신청 시 기재내용에 대해 진실하고 정확하며 현재의
                사실과 일치하도록 유지하고 갱신하여야 합니다.
              </div>
              <div>
                ⑤ 회원은 서비스를 이용하여 얻은 정보를 회사의 사전 승낙없이
                복사, 복제, 변경, 번역, 출판, 방송 기타의 방법으로 사용하거나
                이를 타인에게 제공할 수 없습니다.
              </div>
              <div>
                ⑥ 회원은 음란물 게재, 유포 등 사회질서를 해치는 행위를 할 수
                없습니다.
              </div>
              <div>
                ⑦ 회원은 타인의 명예를 훼손하거나 모욕하는 행위와 타인의
                지적재산권 등의 권리를 침해하는 행위를 할 수 없습니다.
              </div>
              <div>
                ⑧ 회원은 해킹 또는 컴퓨터 바이러스를 유포하는 일, 타인의 의사에
                반하여 광고성 정보 등 일정한 내용을 지속적으로 전송하는 행위를
                할 수 없습니다.
              </div>
              <div>
                ⑨ 회원은 서비스의 운영에 지장을 주거나 줄 우려가 있는 일체의
                행위, 기타 관계 법령에 위배되는 일을 할 수 없습니다.
              </div>
              <v-layout column class="mt-5">
                <h4>제 19조 (양도 금지)</h4>
                <div>
                  회원은 서비스의 이용권한, 기타 이용계약상 지위를 타인에게
                  양도, 증여할 수 없으며, 게시물에 대한 저작권을 포함한 모든
                  권리 및 책임은 이를 게시한 회원에게 있습니다.
                </div>
                <v-layout column class="mt-5">
                  <h4>제 20조 (계약해지 및 이용제한)</h4>
                  <div>
                    ① 회사는 회원이 약관의 내용을 위반하고, 회사 소정의 기간
                    이내에 이를 해소하지 아니하는 경우 서비스 이용계약을 해지할
                    수 있습니다.
                  </div>
                  <div>
                    ② 회사는 제 ①항에 의해 해지된 회원이 다시 이용신청을 하는
                    경우 일정기간 그 승낙을 제한할 수 있습니다.
                  </div>
                  <div>
                    ③ 회원이 이용계약을 해지하고자 하는 때에는 회원 본인이
                    서비스 또는 전자우편을 통하여 해지신청을 하여야 합니다.
                  </div>
                  <v-layout column class="mt-5">
                    <h4>제 21조 (손해배상)</h4>
                    <div>
                      회사가 제공되는 서비스와 관련하여 회원에게 어떠한 손해가
                      발생하더라도 회사의 중대한 과실에 의한 경우를 제외하고
                      이에 대하여 책임을 부담하지 아니합니다.
                    </div>
                    <div>
                      단, 손해배상의 범위는 별도로 회사의 규정에 따릅니다.
                    </div>
                    <v-layout column class="mt-5">
                      <h4>제 22조 (면책 조항)</h4>
                      <div>
                        ① 회사는 회원이 서비스에 거제한 정보, 자료, 사실의
                        정확성, 신뢰성 등 내용에 관하여는 어떠한 책임도 부담하지
                        아니하고 서비스 자료에 대한 취사선택 또는 이용으로
                        발생하는 손해 등에 대해서는 책임이 면제됩니다.
                      </div>
                      <div>
                        ② 회사는 회원이 서비스를 이용하여 기대하는 손익이나
                        서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임이
                        면제됩니다.
                      </div>
                      <div>
                        ③ 회사는 회원 상호간 또는 회원과 제 3자 상호간에
                        서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가
                        없으며 이로 인한 손해를 배상할 책임도 없습니다.
                      </div>
                      <div>
                        ④ 회사는 회원의 귀책사유로 인하여 서비스 이용의 장애가
                        발생한 경우에는 책임이 면제 됩니다.
                      </div>
                      <div>
                        ⑤ 회사는 제휴사가 제공하는 부가서비스의 품질 및 장애에
                        대한 책임은 면제 됩니다.
                      </div>
                      <div>
                        본 약관의 규정을 위반함으로 인하여 회사에 손해가
                        발생하게 되는 경우, 이 약관을 위반한 회원은 회사에
                        발생하는 모든 손해를 배상하여야 하며, 손해로부터 회사를
                        면책시켜야 합니다.
                      </div>
                      <v-layout column class="mt-5">
                        <h4>제 23조 (분쟁의 해결)</h4>
                        <div>
                          ① 회사와 회원은 서비스와 관련하여 발생한 분쟁을
                          원만하게 해결하기 위하여 필요한 모든 노력을 하여야
                          합니다.
                        </div>
                        <div>
                          ② 모든 노력에도 불구하고 소송이 제기될 경우, 소송은
                          회사가 관할하는 법원의 관할로 합니다.
                        </div>
                        <v-layout column class="mt-5">
                          <h4>제 24조 (청약철회 및 환불)</h4>
                          <div>
                            ① 회사는 회원의 진행변경 또는 진행취소 등 청약철회를
                            통해 환불사유가 발생할 시 현금결제의 경우에는
                            7영업일 이내에 회원의 요청계좌로 해당금액을 환불하고
                            카드결제의 경우에는 결제가 취소됩니다.
                          </div>
                          <div>
                            ② 카드결제를 통한 비용납부건의 환불은 원칙적으로
                            카드결제 취소를 통해서만 가능합니다.
                          </div>
                          <div>
                            ③ 회사는 회원으로부터 입금 받은 비용으로 업무를 진행
                            및 처리하여, 업무가 완료되면 정산을 통해 고객의
                            요청계좌로 정산상의 잔액을 환불합니다.
                          </div>
                          <v-layout column class="mt-5">
                            <h4>제 25조 (청약철회 / 환불의 적용배제)</h4>
                            <div>
                              회원의 귀책사유로 인해 해당 업무 상 오류가 발행한
                              경우에는 청약철회 또는 환불을 요청할 수 없습니다.
                            </div>
                          </v-layout>
                        </v-layout>
                      </v-layout>
                    </v-layout>
                  </v-layout>
                </v-layout>
              </v-layout>
            </v-layout>
          </v-layout>
        </v-layout>
      </v-layout>
    </v-layout>

    <v-card color="grey">
      <v-layout align-center>
        <div class="mt-5 mb-5 ml-16" @click="service">이용약관</div>
        <div class="ml-3 mr-3">·</div>
        <div @click="privacy">개인정보처리방침</div>
      </v-layout>
    </v-card>
    <v-card color="black">
      <div class="ml-16 pt-5 whiteText">
        특허법인이노뱅크 | 대표변리사 김태훈 김현석 윤원식 박기선 | 고객센터
        1644-1612 | 사업자등록번호 851-81-02176
      </div>
      <div class="ml-16 mt-2 pb-5 whiteText">
        통신판매업 2019-서울송파-1102 | 서울특별시 송파구 백제고분로 276,
        공익빌딩 502호
      </div>
    </v-card>
  </v-layout>
</template>

<script>
export default {
  data() {
    return {};
  },
  mounted() {},
  methods: {
    mainPage() {
      this.$router.push("/");
    },
    introduce() {
      this.$router.push("/introduce");
    },
    work() {
      this.$router.push("/work");
    },
    consulting() {
      this.$router.push("/consulting");
    },
    design() {
      this.$router.push("/design/design");
    },
    login() {
      this.$router.push("/login");
    },
    service() {
      this.$router.push("/service");
    },
    privacy() {
      this.$router.push("/privacy");
    },
  },
};
</script>

<style scoped>
.background2 {
  background-color: gainsboro;
}
.phoneNumber {
  color: red;
}
.whiteText {
  color: white;
}
.greyText {
  color: grey;
}
</style>